#include <iostream>

using namespace std;

int main()
{
//概念

	//数据结构 + 算法 == 程序

//数据结构
	//概念：存储数据的逻辑结构			物理结构是计算机硬件底层的元件物理原理，逻辑结构才是程序员工作操刀的
	//数据结构分为四类：				后三种是我们学习使用的
		//1.集合型结构（无序，杂乱，无组织无纪律，计算机无法实现理想状态）	//不是我们学习使用的，STL中的set集合型是基于二叉树的数型来实现的，不算这个集合型
		//2.线形型结构：一个前驱节点、一个后驱节点相互连接呈线状
		//3.树型结构	：一个前驱节点，>=0个后驱节点，像树杈一样一个节点延申分支出去
		//4.图形结构：每个节点四通八达，可任意连接，可以像网状一般
					
	//我们学习使用数据结构，不论是哪种类型，都是创建、增、删、改、查 节点这5种操作
	//创建、增、删、改、查 这5种是最最主要的操作，其它的一小些都是很次要的、
	//学好不同类型这5点就掌握好了数据结构

//算法
	//概念：计算方法 -> 运算数据的逻辑
	//主要：排序算法、查找算法，这些是基本算法，还有一些高阶算法，那偶有了解即可

//前言
	//老师推荐剑指offic那本书，学习那80道题的思想
	//学习这门课学好了比刷题好多了，leetcode在面试前一个月刷刷就行
	//编程思路很重要，思路一出，代码就出来了，不要让基本语法什么成为阻碍
	//数据结构与算法，学习前辈怎么做的就可以了，站在巨人的肩膀上，不要自己捣鼓算法，学习更高效，就像背乘法表，背好就用，不必挨个加法
	//要找工作得成体系学习，c、c++、数据库、数据结构与算法、QT、TCP\IP、多线程、进程、SQT
	//了解一些专业名词、概念，如时间、空间复杂度等

	//面试笔试常考：快速排序（背就完了）、二叉树前后遍历、红黑树等
	//70%笔试面试都是问数据结构与算法

	return 0;

}