#include <stdio.h>

//介绍与建议
void WuKongDanXiang()
{
	//学习建议：数据结构（链表等）、算法（各种排序等）只在网上的写法都大同小异，找准一个直接学习完，背下来
	//因为这种这样的好处是，在工作中，我们如果背下来，直接就写了，不用再想了再构建，浪费时间精力
	//算法也是，都大同小异，背下来能省很多事，要达到一种非常熟练的地步。
	//就避免重新思考、编写、调试、出问题再修改。C3老师的代码用了很多年，都没修改过，这算是一种捷径吧。


	//链表常用结构分为：有空头链表、无空头链表

	//1.有空头链表
	//链表的头节点不装数据，只装着第2个节点的地址，且永远都是链表头不变
	//头添加/删除，则是在第2节点前添加/删除，空头节点再指向新的第2节点
	//尾、中间添加/删除与其它链表都一样
	
	//2.无空头链表
	//与伪链表一样，链表头节点装着数据和下一节点地址
	//正常的头添加/删除、尾添加/删除、中间添加/删除

}


int main(void)
{


	system ("pause>0");
	return 0;
}