//#include <stdio.h>
//#include <stdlib.h>
//
//
//int main(void)
//{
//	int a = 423125 ;       //integer的缩写：整数。int这种叫做关键字，c语言里有很多个
//	int b = 5698745;       //定义一个int类型变量，变量名字为b，将后面的参数赋值给b
//	                       //int是整数类型，不能把小数赋值给它，否则逻辑上出现错误
//	                       //数据的类型要与变量的类型对应
//	                       //不要用中文变量名，尽量用英文变量名，可以用单词组合，方便自己记忆
//
//	printf("%d %d \n", a , b);
//	printf("%d %d \n", a , b);
//	printf("%d %d \n", a , b);
//	printf("%d %d \n", a , b);
//
//
//
//	////12       //当我们输入一个整数，计算机默认把它当作int类型来处理，
//
//	//printf("%d %d \n", 1563255 , 45685412);   //当数字位数比较多，而且多次使用，位置很多
//	//printf("%d %d \n", 1563255 , 45685412);   //根本不容易记住，容易出错，挨个修改也十分麻烦
//	//printf("%d %d \n", 1563255 , 45685412);   //但少修改一次程序都会出现问题。
//	//printf("%d %d \n", 1563255 , 45685412);
//
//
//
//	system("pause");      //注意，这行命令在手机上，linux里是报错的，只能在windows系统用
//	return 0;
//}