#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	int a[5] = { 9, 4, 5, 7, 2 };
	int* p = &a[0];  //数组名字本质：地址+【偏移量】
	int i = 0;

	for (i = 0; i < 5; i++)
	{
		printf("%d, %d \n", a[i], p[i]);//p[0], p[1], p[2]是指针的下标运算。
	}					//准确的说，下标运算不是数组专属，数组只是满足了下标运算符的使用条件
						//而指针也完全可以使用下标运算符的：地址+[偏移量]

	int o = 56;
	int* p1 = &o;

	p1[0] = 65;        //*(p1) == p1[0], *(p1+1) == p1[1],以此类推

	p1[5] = 77;			//这是越界写入，因为p1[0]==*p1==&o,
						//而p1[5]则是*(p1+5),现在不知道访问写入到哪个变量的空间了

	printf("%d, %d, %d \n", p1[0], o, p1[5]);


	system("pause");
	return 0;
}