#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	int y[5] = { 5,8,2,7,4 };

	printf("%d\n", sizeof(y));   //查看数组所占内存大小，单位：字节

	printf("%d, %d, %d, %d, %d \n", y[0], y[1], y[2], y[3], y[4]);//打印每个元素的数值

	printf("%p, %p, %p, %p, %p \n", &y[0], &y[1], &y[2], &y[3], &y[4]);
						//打印每个元素的地址，%p 是16进制整数输出，通用的计算机地址进制
	printf("%d, %d, %d, %d, %d \n", &y[0], &y[1], &y[2], &y[3], &y[4]);
	                    //打印每个元素的地址，10进制的地址
	printf("%d, %d, %d  \n", &y[0], &y[0] + 1, &y[0] + 2);//地址偏移
	                    //这样+1是加一个定义类型的大小，int为4字节，double为8字节，元素+1就是下一个（元素）用户的地址
						//因为分配给数组元素的空间是挨着的，所以地址间隔为定义的数值类型大小
	printf("%d, %d \n", &y, &y + 1);
	                    //直接差找数组地址的话，就是第一个元素y[0]的地址，数组+1是下一个数组的开头
						//数组与元素地址，就像小区地址与用户地址一样，用户住在小区里


	system("pause");
	return 0;
}