#include <stdio.h>
#include <stdlib.h>

int main(void)
{
	2 > 3 && 5 > 4 && 4 >= 3;

	int a = 0;
	int b = 2;

	//(a = 3 > 2) && (b = 3);   //不可以把小括号去掉，否则会出现错误，&&的优先级比其他的要高
							  //会出现3>2为1（真）与上被3赋值的b，变成a = 1 = 3，
							  //就会出现常量给常量赋值的错误
	//printf("%d %d \n", a, b); //此时输出结果为1 3  前半部判断为1（真），给a赋值，后半部3给b赋值
	   
							 
	//(a = 3 < 2) && (b = 3);	  //&&遇到0（假）短路（遇到0就不判断了）,此时输出结果为 0 2 							  
	//printf("%d %d \n", a, b); //前半部判断为0（假）后半部被短路是原值2

	//(a = 3 < 2) || (b = 3);      
	//printf("%d %d \n", a, b); //此时输出结果为 0 3 前半部为0（假），后半部3给b赋值

	//(a = 3 > 2) || (b = 3);    
	//printf("%d %d \n", a, b);  //|| 遇1（真）短路（遇到1就不判断了），此时输出结果为 1 2 
							     //前半部分为1（真），后半部分被短路是原值2

	system("pause");
	return 0;
}